# Арифметические операции
# +, -, *, /, %, //, **
# Приоритет операций:
# **, ⊕, ⊖, *, /, //, %, +, -
# () меняют приоритет

a = 1.312312123  # + -унарный плюс, - -унарный минус
b = 3
c = a*b  # / -вещественное деление, // - деление до целого числа, % -остаток, ** -возведение в степень
c = round(a*b, 10)  # round -округление
print(c)

a = 5
a += 5 # равносильно a = a + 5
print(a)

iter = 2
iter += 3 # iter = iter + 3
iter -= 4 # iter = iter - 4
iter *= 5 # iter = iter * 5
iter /= 5 # iter = iter / 5
iter //= 5 # iter = iter // 5
iter %= 5 # iter = iter % 5
iter **= 5 # iter = iter ** 5